# NPCA Salaries Clean-up Exercise

Daina Bouquin

In [1]:
import pandas as pd
import numpy as np

# Import and additional restructuring

## Convert xlsx to dataframe

In [2]:
df = pd.read_excel(r'SalarySurveyExercise.xlsx')

## Create unique IDs

In [3]:
df["id"] = df.index + 1 # add ID column
cols = df.columns.tolist() # columns to list to make rearranging them easier 
cols = cols[-1:] + cols[:-1] # move ID column to the front
df = df[cols]

## Rename columns

In [4]:
# rename method 1
df.rename(columns={'Timestamp': 'timestamp',
                   'How old are you?': 'age_range',
                   'What industry do you work in?': 'industry',
                   'Job title': 'job',
                   'If your job title needs additional context, please clarify here:': 'job_context',
                   'Please indicate the currency': 'currency',
                   'If "Other," please indicate the currency here:': 'other_currency',
                   'If your income needs additional context, please provide it here:': 'income_context',
                   'What country do you work in?': 'country',
                   'What city do you work in?': 'city',
                   'How many years of professional work experience do you have overall?': 'all_experience',
                   'How many years of professional work experience do you have in your field?': 'field_experience',
                   'What is your highest level of education completed?': 'education-level',
                   'What is your gender?': 'gender'
                  }, inplace=True)

# rename method 2 (columns with problem characters)
df.columns.values[6] = 'annual_salary'
df.columns.values[7] = 'add_compensation'
df.columns.values[12] = 'state'
df.columns.values[18] = 'race'

## Clean up country names

In [5]:
df.country.unique()

array(['United States', 'USA', 'Canada', 'Spain', 'England', 'US',
       'United Kingdom', 'UK', 'United States of America', 'U.S.A.',
       'Netherlands', 'Uk', 'U.S.', 'usa', 'Germany', 'Us', 'Usa',
       'Belgium', 'South Africa', 'us', 'U.S.A', 'Sweden', 'England/UK',
       'France', 'Australia', 'united states',
       'Worldwide (based in US but short term trips aroudn the world)',
       'Denmark', 'Unted States', 'United State', 'Trinidad and Tobago',
       'United states', 'United kingdom', 'Scotland', 'America',
       'Finland', 'Unites States', 'Bangladesh', 'Ireland',
       'Currently finance', ' U.S.', 'U.S', 'Turkey', 'canada', 'Japan',
       'Hong Kong', 'India', 'Czech Republic', 'Switzerland',
       'New Zealand', 'Indonesia', 'Norway', 'The Netherlands', 'The US',
       'Singapore', 'Wales (United Kingdom)', 'UnitedStates', 'UAE',
       'Unite States', 'USAB', 'Unites states', 'Unites kingdom', 'U. S.',
       'SWITZERLAND', 'Malaysia',
       "I work for an US based company but I'm from Argentina.", 'uk',
       'Portugal', 'Israel', 'United states of America', 'Brazil',
       'South Korea', 'Austria', 'Latvia', 'Romania', 'UA', 'Lithuania',
       'united kingdom', 'Wales', 'Estonia', 'NZ',
       'England, United Kingdom', 'Bermuda', 'Aotearoa New Zealand',
       'new zealand', 'Thailand', 'Cyprus', 'NIGERIA', 'Poland'],
      dtype=object)

In [6]:
# inspect anomalies 
df.loc[df['country'] == 'Currently finance']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,city,all_experience,field_experience,education-level,gender,race
750,751,2021-04-27 14:44:02,45-54,"Marketing, Advertising & PR",Digital Specialist,NaN,90000,0.0,USD,NaN,NaN,Currently finance,Oregon,Portland,11 - 20 years,11 - 20 years,College degree,Man,White

In [7]:
df['country'] = df['country'].replace(['Currently finance'], 'United States') 
# code as USA

In [8]:
# inspect anomalies 
df.loc[df['country'] == 'UA']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,city,all_experience,field_experience,education-level,gender,race
2117,2118,2021-04-29 14:04:07,35-44,Education (Higher Education),Associate Consultant,NaN,105000,18000.0,USD,NaN,NaN,UA,Minnesota,Minneapolis,11 - 20 years,11 - 20 years,College degree,Woman,White

In [9]:
df['country'] = df['country'].replace(['UA'], 'United States') 
# code as USA

In [10]:
# inspect anomalies 
df.loc[df['country'] == 'I work for an US based company but I\'m from Argentina.']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,city,all_experience,field_experience,education-level,gender,race
1669,1670,2021-04-28 17:38:09,25-34,Translation,Audiovisual Translator,NaN,240000,NaN,Other,ARS,"I'm a freelancer, so my work varies tremendous...",I work for an US based company but I'm from Ar...,NaN,San Nicolás de los Arroyos,2 - 4 years,5-7 years,College degree,Woman,"Hispanic, Latino, or Spanish origin"

In [11]:
df['country'] = df['country'].replace(['I work for an US based company but I\'m from Argentina.'], 'Argentina') 
# code as Argentina

In [12]:
# inspect anomalies 
df.loc[df['country'] == 'Worldwide (based in US but short term trips aroudn the world)']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,city,all_experience,field_experience,education-level,gender,race
313,314,2021-04-27 11:56:49,35-44,Federal Government Contracting,Senior Acquisition & Assistance Specialist,"I do the same job as a federal direct hire, bu...",125500,2000.0,USD,NaN,I have a base salary but I bill to my contract...,Worldwide (based in US but short term trips ar...,District of Columbia,"Washington, DC",11 - 20 years,11 - 20 years,Master's degree,Woman,"Asian or Asian American, White"

In [13]:
df['country'] = df['country'].replace(['Worldwide (based in US but short term trips aroudn the world)'], 'United States')  # code as USA

In [14]:
# inspect anomalies 
df.loc[df['country'] == 'USAB']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,city,all_experience,field_experience,education-level,gender,race
1432,1433,2021-04-28 13:43:11,35-44,Education (Primary/Secondary),Special Education Teacher,NaN,65000,7500.0,USD,NaN,NaN,USAB,South Carolina,Greenville,11 - 20 years,11 - 20 years,Master's degree,Woman,White

In [15]:
df['country'] = df['country'].replace(['USAB'], 'United States') 
# code as USA

In [16]:
# inspect anomalies 
df.loc[df['country'] == 'UAE']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,city,all_experience,field_experience,education-level,gender,race
1257,1258,2021-04-28 08:49:40,25-34,Property or Construction,Proposals & Marketing Manager,NaN,98000,0.0,USD,NaN,NaN,UAE,NaN,Dubai,8 - 10 years,2 - 4 years,Master's degree,Other or prefer not to answer,Another option not listed here or prefer not t...

In [17]:
df['country'] = df['country'].replace(['UAE'], 'United Arab Emirates') 
# United Arab Emirates

In [18]:
# clean up country names
df['country'] = df['country'].replace([
                    'United States',
                    'US',
                    'USA',
                    'United States of America',
                    'U.S.A.',
                    'U.S.A',
                    'U.S.',
                    ' U.S.',
                    'usa',
                    'Us',
                    'Usa',
                    'us',
                    'united states',
                    'Unted States',
                    'United State',
                    'United states',
                    'America',
                    'Unites States',
                    'U.S',
                    'The US',
                    'U. S.',
                    'UnitedStates', 
                    'Unite States', 
                    'Unites states', 
                    'United states of America',
                    'Worldwide (based in US but short term trips aroudn the world)',
                    'Currently finance',
                    'UA'],
                                      'United States')

In [19]:
df['country'] = df['country'].replace([
                    'Canada',
                    'canada'],
                                    'Canada')

In [20]:
df['country'] = df['country'].replace([
                    'England',
                    'United Kingdom', 
                    'UK',
                    'Uk',
                    'England/UK',
                    'United kingdom',
                    'Scotland',
                    'Wales (United Kingdom)',
                    'Unites kingdom',
                    'uk',
                    'united kingdom',
                    'Wales',
                    'England, United Kingdom'],
                                      'United Kingdom')

In [21]:
df['country'] = df['country'].replace([
                    'Netherlands',
                    'The Netherlands'],
                                    'Netherlands')

In [22]:
df['country'] = df['country'].replace([
                    'Switzerland',
                    'SWITZERLAND'],
                                    'Switzerland')

In [23]:
df['country'] = df['country'].replace([
                    'New Zealand',
                    'NZ',
                    'Aotearoa New Zealand',
                    'new zealand'],
                                    'New Zealand')

In [24]:
df['country'] = df['country'].replace(['NIGERIA'], 'Nigeria')

In [25]:
df.country.unique()

array(['United States', 'Canada', 'Spain', 'United Kingdom',
       'Netherlands', 'Germany', 'Belgium', 'South Africa', 'Sweden',
       'France', 'Australia', 'Denmark', 'Trinidad and Tobago', 'Finland',
       'Bangladesh', 'Ireland', 'Turkey', 'Japan', 'Hong Kong', 'India',
       'Czech Republic', 'Switzerland', 'New Zealand', 'Indonesia',
       'Norway', 'Singapore', 'United Arab Emirates', 'Malaysia',
       'Argentina', 'Portugal', 'Israel', 'Brazil', 'South Korea',
       'Austria', 'Latvia', 'Romania', 'Lithuania', 'Estonia', 'Bermuda',
       'Thailand', 'Cyprus', 'Nigeria', 'Poland'], dtype=object)

## Clean up race

In [26]:
df.race.unique()

array(['Hispanic, Latino, or Spanish origin, White',
       'Asian or Asian American', 'White',
       'Another option not listed here or prefer not to answer',
       'Asian or Asian American, White',
       'Hispanic, Latino, or Spanish origin', 'Black or African American',
       'Black or African American, White',
       'Native American or Alaska Native, White',
       'Middle Eastern or Northern African, White', nan,
       'Black or African American, Hispanic, Latino, or Spanish origin',
       'Hispanic, Latino, or Spanish origin, Native American or Alaska Native',
       'White, Another option not listed here or prefer not to answer',
       'Asian or Asian American, Hispanic, Latino, or Spanish origin',
       'Hispanic, Latino, or Spanish origin, Another option not listed here or prefer not to answer',
       'Black or African American, Hispanic, Latino, or Spanish origin, Native American or Alaska Native, White',
       'Native American or Alaska Native',
       'Middle Eastern or Northern African',
       'Asian or Asian American, Black or African American, White',
       'Black or African American, Hispanic, Latino, or Spanish origin, White',
       'Middle Eastern or Northern African, Native American or Alaska Native, White',
       'Middle Eastern or Northern African, White, Another option not listed here or prefer not to answer',
       'Asian or Asian American, Black or African American',
       'Asian or Asian American, Hispanic, Latino, or Spanish origin, White, Another option not listed here or prefer not to answer'],
      dtype=object)

In [27]:
# remove commas to enable split
df['race'] = df['race'].str.replace('Hispanic, Latino, or Spanish origin','Hispanic Latino or Spanish origin')

In [28]:
df["race"] = df["race"].str.split(",")

In [29]:
df = df.explode("race")

In [30]:
# fix issue with leading and trailing white space again
df = df.replace(r"^ +| +$", r"", regex=True)

In [31]:
df.race.unique()

array(['Hispanic Latino or Spanish origin', 'White',
       'Asian or Asian American',
       'Another option not listed here or prefer not to answer',
       'Black or African American', 'Native American or Alaska Native',
       'Middle Eastern or Northern African', nan], dtype=object)

In [32]:
# add multiracial column
multiracial = df[df.duplicated('id', keep=False) == True]
multiracial_id = (multiracial.id.unique().tolist())
df["multiracial"] = np.where(df["id"].isin(multiracial_id), "Yes", "No")

## Clean up states

In [33]:
df.state.unique()

array(['Florida', 'Ohio', 'District of Columbia', 'Massachusetts',
       'Illinois', 'Minnesota', 'New York', 'Maryland', 'Oregon',
       'North Carolina', 'Colorado', nan, 'Pennsylvania', 'New Jersey',
       'California', 'Virginia', 'South Carolina', 'North Dakota',
       'Washington', 'Kansas', 'Indiana', 'Texas', 'Missouri', 'Delaware',
       'Georgia', 'Michigan', 'Kentucky', 'Rhode Island', 'South Dakota',
       'New Hampshire', 'Louisiana', 'New Mexico', 'Connecticut',
       'Oklahoma', 'Arizona', 'Vermont', 'Utah', 'Idaho', 'Tennessee',
       'Nebraska', 'West Virginia', 'Wisconsin', 'Mississippi', 'Alabama',
       'California, Colorado', 'Maine', 'Alabama, District of Columbia',
       'Arkansas', 'Nevada', 'Iowa', 'Alaska', 'Hawaii',
       'New Jersey, New York', 'Montana', 'Wyoming',
       'Georgia, Massachusetts', 'California, Texas',
       'Indiana, Massachusetts', 'Mississippi, Missouri',
       'California, Illinois, Massachusetts, North Carolina, South Carolina, Virginia'],
      dtype=object)

In [34]:
df["state"] = df["state"].str.split(",")

In [35]:
df = df.explode("state")

In [36]:
df.state.unique()

array(['Florida', 'Ohio', 'District of Columbia', 'Massachusetts',
       'Illinois', 'Minnesota', 'New York', 'Maryland', 'Oregon',
       'North Carolina', 'Colorado', nan, 'Pennsylvania', 'New Jersey',
       'California', 'Virginia', 'South Carolina', 'North Dakota',
       'Washington', 'Kansas', 'Indiana', 'Texas', 'Missouri', 'Delaware',
       'Georgia', 'Michigan', 'Kentucky', 'Rhode Island', 'South Dakota',
       'New Hampshire', 'Louisiana', 'New Mexico', 'Connecticut',
       'Oklahoma', 'Arizona', 'Vermont', 'Utah', 'Idaho', 'Tennessee',
       'Nebraska', 'West Virginia', 'Wisconsin', 'Mississippi', 'Alabama',
       ' Colorado', 'Maine', ' District of Columbia', 'Arkansas',
       'Nevada', 'Iowa', 'Alaska', 'Hawaii', ' New York', 'Montana',
       'Wyoming', ' Massachusetts', ' Texas', ' Missouri', ' Illinois',
       ' North Carolina', ' South Carolina', ' Virginia'], dtype=object)

In [37]:
df = df.replace(r"^ +| +$", r"", regex=True) # fix issue with leading and trailing white space

In [38]:
df.state.unique()

array(['Florida', 'Ohio', 'District of Columbia', 'Massachusetts',
       'Illinois', 'Minnesota', 'New York', 'Maryland', 'Oregon',
       'North Carolina', 'Colorado', nan, 'Pennsylvania', 'New Jersey',
       'California', 'Virginia', 'South Carolina', 'North Dakota',
       'Washington', 'Kansas', 'Indiana', 'Texas', 'Missouri', 'Delaware',
       'Georgia', 'Michigan', 'Kentucky', 'Rhode Island', 'South Dakota',
       'New Hampshire', 'Louisiana', 'New Mexico', 'Connecticut',
       'Oklahoma', 'Arizona', 'Vermont', 'Utah', 'Idaho', 'Tennessee',
       'Nebraska', 'West Virginia', 'Wisconsin', 'Mississippi', 'Alabama',
       'Maine', 'Arkansas', 'Nevada', 'Iowa', 'Alaska', 'Hawaii',
       'Montana', 'Wyoming'], dtype=object)

In [39]:
# add multistate column
multistate = df[df["multiracial"] == 'No']
multistate = (multistate[multistate.duplicated('id', keep=False) == True])
multistate_id = (multistate.id.unique().tolist())
df["multistate"] = np.where(df["id"].isin(multistate_id), "Yes", "No")

## Clean up add_compensation

In [40]:
df['add_compensation'] = df['add_compensation'].fillna(0) # replace NaN with zeros

## Clean up currencies

In [41]:
df.currency.unique()

array(['USD', 'CAD', 'EUR', 'GBP', 'ZAR', 'SEK', 'AUD/NZD', 'Other',
       'CHF', 'JPY'], dtype=object)

In [42]:
df.other_currency.unique()

array([nan, 'Dkk', 'TTD', 'GBP', 'Bdt', 'Additonal = Bonus plus stock',
       'Overtime (about 5 hours a week) and bonus', 'TRY', 'Canadian',
       'INR', 'Czk', 'IDR', 'NOK', 'SGD', 'AUD', 'MYR', 'ARS',
       'Israeli Shekels', 'BRL', 'KRW', 'None', 'Korean Won', 'NZD',
       '47000', 'THB', 'NGN', 'PLN'], dtype=object)

In [43]:
# inspect anomalies 
df.loc[df['other_currency'] == 'GBP']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
541,542,2021-04-27 13:08:37,25-34,Education (Higher Education),Senior Research Fellow/Assistant Professor,NaN,41000,0.0,Other,GBP,...,United Kingdom,NaN,Glasgow,5-7 years,5-7 years,PhD,Woman,White,No,No

In [44]:
# recode as currency = GBP and other_currency = nan

df['other_currency'] = df['other_currency'].replace(['GBP'], 'NaN')
df.at[541,'currency']='GBP'

In [45]:
df.loc[df['id'] == 542]

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
541,542,2021-04-27 13:08:37,25-34,Education (Higher Education),Senior Research Fellow/Assistant Professor,NaN,41000,0.0,GBP,NaN,...,United Kingdom,NaN,Glasgow,5-7 years,5-7 years,PhD,Woman,White,No,No

In [46]:
# inspect anomalies 
df.loc[df['other_currency'] == 'Additonal = Bonus plus stock']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
739,740,2021-04-27 14:35:26,45-54,Computing or Tech,Content specialist,NaN,62000,17000.0,EUR,Additonal = Bonus plus stock,...,Ireland,NaN,"Small country, prefer not to say!",31 - 40 years,8 - 10 years,College degree,Woman,White,No,No

In [47]:
# recode as other_currency = NaN and income_context = 'Additonal = Bonus plus stock'

df['other_currency'] = df['other_currency'].replace(['Additonal = Bonus plus stock'], 'NaN')
df.at[739,'income_context']='Additonal = Bonus plus stock'

In [48]:
df.loc[df['id'] == 740]

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
739,740,2021-04-27 14:35:26,45-54,Computing or Tech,Content specialist,NaN,62000,17000.0,EUR,NaN,...,Ireland,NaN,"Small country, prefer not to say!",31 - 40 years,8 - 10 years,College degree,Woman,White,No,No

In [49]:
# inspect anomalies 
df.loc[df['other_currency'] == 'Overtime (about 5 hours a week) and bonus']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
803,804,2021-04-27 15:23:13,25-34,Computing or Tech,Executive Assiatant II,Grade 6,86000,20000.0,USD,Overtime (about 5 hours a week) and bonus,...,United States,Massachusetts,"HQ us in Cambridge, Ma but moving to the subur...",5-7 years,2 - 4 years,College degree,Woman,White,No,No

In [50]:
# recode as other_currency = NaN and income_context = 'Overtime (about 5 hours a week) and bonus'

df['other_currency'] = df['other_currency'].replace(['Overtime (about 5 hours a week) and bonus'], 'NaN')
df.at[803,'income_context']='Overtime (about 5 hours a week) and bonus'

In [51]:
df.loc[df['id'] == 804]

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
803,804,2021-04-27 15:23:13,25-34,Computing or Tech,Executive Assiatant II,Grade 6,86000,20000.0,USD,NaN,...,United States,Massachusetts,"HQ us in Cambridge, Ma but moving to the subur...",5-7 years,2 - 4 years,College degree,Woman,White,No,No

In [52]:
# inspect anomalies 
df.loc[df['other_currency'] == '47000']

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
2707,2708,2021-07-06 18:49:41,25-34,Nonprofits,Districtwide Program Coordinator,NaN,47000,0.0,USD,47000,...,United States,Michigan,Decatur,8 - 10 years,8 - 10 years,Master's degree,Woman,White,No,No

In [53]:
# recode as other_currency = NaN 

df['other_currency'] = df['other_currency'].replace(['47000'], 'NaN')
df.loc[df['id'] == 2708]

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,...,country,state,city,all_experience,field_experience,education-level,gender,race,multiracial,multistate
2707,2708,2021-07-06 18:49:41,25-34,Nonprofits,Districtwide Program Coordinator,NaN,47000,0.0,USD,NaN,...,United States,Michigan,Decatur,8 - 10 years,8 - 10 years,Master's degree,Woman,White,No,No

In [54]:
df['other_currency'] = df['other_currency'].replace([
                    'Dkk', 
                    'Bdt', 
                    'Czk', 
                    'Korean Won', 
                    'Israeli Shekels',
                    'Canadian'],  
                        ['DKK', 
                         'BDT', 
                         'CZK', 
                         'KRW', 
                         'ILS',
                         'CAD'])

In [55]:
df.other_currency.unique()

array([nan, 'DKK', 'TTD', 'NaN', 'BDT', 'TRY', 'CAD', 'INR', 'CZK', 'IDR',
       'NOK', 'SGD', 'AUD', 'MYR', 'ARS', 'ILS', 'BRL', 'KRW', 'None',
       'NZD', 'THB', 'NGN', 'PLN'], dtype=object)

## Drop city data
It's such a mess and I'm not planning to use it. Could do more work to clean it up and try resolving problems with either OpenRefine or Google Maps API, but it's just not precise enough to be useful (e.g., "metro area").

In [56]:
df = df.drop(['city'], axis=1)
df.head(1)

,id,timestamp,age_range,industry,job,job_context,annual_salary,add_compensation,currency,other_currency,income_context,country,state,all_experience,field_experience,education-level,gender,race,multiracial,multistate
0,1,2021-04-27 11:03:01,35-44,"Accounting, Banking & Finance",Senior Accountant,NaN,45000,0.0,USD,NaN,I work for a Charter School,United States,Florida,21 - 30 years,21 - 30 years,College degree,Woman,Hispanic Latino or Spanish origin,Yes,No

## Clean up industry

In [57]:
# df.industry.unique() # Used a text editor to quickly organize these

In [58]:
# create new broader categories

df['industry'] = df['industry'].replace([
                    'Accounting, Banking & Finance',
                    'Mortgage',
                    'FinTech/Payment Processing',
                    'commodities trading'],
                                      'Financial')

In [59]:
df['industry'] = df['industry'].replace([
                    'Government and Public Administration',
                    'Government Relation'],
                                      'Government')

In [60]:
df['industry'] = df['industry'].replace([
                    'Computing or Tech',
                    'IT MSP',
                    'Virtual reality',
                    'Saas',
                    'I work for Indeed.com',
                    'Customer Service'],
                                      'Tech')

In [61]:
df['industry'] = df['industry'].replace([
                    'Synthetic Chemical Manufacturing',
                    'Engineering or Manufacturing',
                    'Manufacturing',
                    'Manufacturing : corporate admin support'],
                                      'Manufacturing')

In [62]:
df['industry'] = df['industry'].replace([
                    'Nonprofits',
                    'Nonprofit - legal department'],
                                      'Nonprofit')

In [63]:
df['industry'] = df['industry'].replace([
                    'Consumer goods',
                    'Consumer Good (Toys)',
                    'Wholesale - Apparel',
                    'Retail', 
                    'FMCG',
                    'Consumer Goods',
                    'FMCG development',
                    'Ecommerce',
                    'Ecommerce',
                    'Fashion/e-commerce'],
                                      'Consumer Goods')

In [64]:
df['industry'] = df['industry'].replace([
                    'Sales',
                    'Sales operations'],
                                      'Sales')

In [65]:
df['industry'] = df['industry'].replace([
                    'Real Estate',
                    'Real Estate',       
                    'Property Management',
                    'Commercial Real Estate'],
                                      'Property or Construction')

In [66]:
df['industry'] = df['industry'].replace([
                    'Instructional Design and Training', 
                    'Educational technology',
                    'Educational publishing / ed tech',
                    'ESL Teacher'],
                                      'Other Education')

In [67]:
df['industry'] = df['industry'].replace([
                    'Education (Higher Education)',
                    'Academic science',
                    'Science academia',
                    'Research - academic',
                    'Research and Development Academia',
                    'academic research',
                    'Academic science'],
                                      'Higher Education')

In [68]:
df['industry'] = df['industry'].replace([
                    'Marketing and PR',
                    'market research',
                    'Market Research',
                    'Public affairs / PR'],
                                      'Marketing, Advertising & PR')

In [69]:
df['industry'] = df['industry'].replace([
                    'Supply Chain',
                    'Coffee - Importing',
                    'Logistics'],
                                      'Transport or Logistics')

In [70]:
df['industry'] = df['industry'].replace([
                    'Hospital', 
                    'Public health',
                    'Healthcare IT'],
                                        'Health Care')

In [71]:
df['industry'] = df['industry'].replace([
                    'clinical research',
                    'biomedical research',
                    'Medical Research',
                    'Biology/Research',
                    'Biomedical Research',
                    'Biologist'],
                                        'Biomedical Research')

In [72]:
df['industry'] = df['industry'].replace([
                    'Bitech',
                    'Biotech/Pharma',
                    'Biotech',
                    'Biotechnology',
                    'Biotech/pharmaceuticals',
                    'Biotech/pharma',
                    'Biotech/Drug Development',
                    'Pharmaceutical',
                    'Pharmaceutical Research',
                    'Pharmaceutical research',
                    'Pharmaceuticals',
                    'Pharma',
                    'Pharmaceutical R&D',
                    'Drug development'],
                                        'Pharmaceuticals')

In [73]:
df['industry'] = df['industry'].replace([
                    'Recruitment or HR',
                    'Human Resources',
                    'Benefits Administration'],
                                        'Human Resources')

In [74]:
df['industry'] = df['industry'].replace([
                    'Defense contracting',
                    'Federal Contracting/Business Development',
                    'Federal Government Contracting'],
                                        'Government Contracting')

In [75]:
df['industry'] = df['industry'].replace([
                    'apparel design/product development'],
                                        'Art & Design')

In [76]:
df['industry'] = df['industry'].replace([
                    'Oil & Gas', 
                    'Renewable Energy',
                    'Energy: oil & gas'],
                                        'Energy')

In [77]:
df['industry'] = df['industry'].replace([
                    'Security'],
                                        'Law Enforcement & Security')

In [78]:
df['industry'] = df['industry'].replace([
                    'Public Librarian',
                    'Public Library',
                    'Librarian and Assistant Manager of a library',
                    'Public library', 
                    'Library',     
                    'Librarian in legal setting',
                    'municipal (public) libraries',
                    'Libraries',
                    'Public Libraries',
                    'Library/Archive',
                    'Library science / part-time work/study',
                    'Library Tech for a school system',
                    'library',
                    'Librarian',
                    'Museums',
                    'Archives/Libraries',
                    'Education (Other)'], #checked title
                                        'Libraries & Museums')

In [79]:
df['industry'] = df['industry'].replace([
                    'auto repair',
                    'Automotive technician',
                    'Automotive'],
                                        'Automtive Repair')

In [80]:
df['industry'] = df['industry'].replace([
                    'Government Affairs/Lobbying',
                    'Politics', 
                    'Union/political organizing'],
                                        'Politics')

In [81]:
df['industry'] = df['industry'].replace([
                    'Veterinary medicine',
                    'Pet',
                    'Veterinary m&a'],
                                        'Veterinary')

In [82]:
df['industry'] = df['industry'].replace([
                    'Environmental Consulting',
                    'Environmental consulting',
                    'Consulting',
                    'Consultant',  
                    'Business or Consulting'],
                                        'Consulting')

In [83]:
df['industry'] = df['industry'].replace([
                    'Restaurant',
                    'Food Manufacture',
                    'Food service',
                    'Craft Beer Industry',  
                    'Beverage'],
                                        'Food & Beverage')

In [84]:
df['industry'] = df['industry'].replace([
                    'Fundraising for a university'],
                                        'Fundraising')

In [85]:
df['industry'] = df['industry'].replace([
                    'Faith/spirituality', 
                    'Clergy'],
                                        'Faith & Spirituality')

In [86]:
df['industry'] = df['industry'].replace([
                    'funeral services',
                    'Funeral services'],
                                        'Funeral Services')

In [87]:
df['industry'] = df['industry'].replace([
                    'Environmental',
                    'Enviromental',
                    'Environment',
                    'Environmental Restoration'],
                                        'Environmental')

## Final clean up and export

In [88]:
# fix all nan values
df.fillna('NaN', inplace=True)

In [89]:
df.to_csv('clean_salaries.csv')